app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"
---
    def index
      @posts = Post.paginate(page: params[:page], per_page: 15)